banTexts = [
    "子杰",
    "zj",
    "ZJ",
    "Zj",
    "zJ",
    "子j",
    "子J",
    "子傑",
    "z杰",
    "WhiskyonRock",
    "ㄗㄐ"
]

i2Texts = [
    "i2",
    "哀額",
    "唉額"
]

channels = [
    "避難所💬",
    "林阿罵👅💦",
    "練等專區",
    "一般"
]

songs = [
    "還在夏天呢☀️你看Wi-Fi滿格📶 還在夏天呢☀️你看海水藍的🌊 還在夏天呢☀️你看啤酒冰的🍺 人生就該及時行樂",
    "我要穿越這片沙漠 找尋真的自我 身邊只有一匹駱駝陪我\n這片風兒吹過 那片雲兒飄過 突然之間出現愛的小河",
    "麻煩貴戶 家中阿法，不時半夜整晚騎駱駝 大吼大叫\n到早上才消停 請考慮別人需要休息 (長期)"
]

jokes = [
    "我今天去買麵請老闆幫我加筍絲，結果回到家打開發現他忘了加本來很生氣，後來想想算了，反正我也没有損失(筍絲)",
    "我剛剛偷偷用光我爸的潤髮劑，我爸氣的想要抓我的頭髮痛扁一頓，笑死，他根本抓不住",
    "之前有人在路上問我成大在哪\n我說：前面直走到底後右轉\n他很客氣的跟我道謝\n我靦腆的回他：不會，那裡是警察局，可以問警察。",
    "為什麼小亮進BYG之前叫小亮寶寶，進BYG之後就改成小亮了\n因為寶寶被丁特拿掉了",
    "笑死😂😂😂👍👍這你自己想出來的嗎😳😳很厲害欸😎😎 哈哈是我啦你是不是很懂國文造詣啊skrskr🤙🤙🤙😎😎😎👊👊👊🖕🖕🖕🖖🖖🖖 peace",
    "蔡有爵很有料\n蔡有料",
    "有人邊看實況邊打LOL但蔡有爵不生氣\n蔡有禮",
    "喜得跟我說他破處了，我問他在哪，他說屁眼",
    "有一天彬彬他爸很渴 就叫彬彬幫他倒水 但彬彬遲遲沒去倒 彬彬爸就說：「你是要逼爸渴死嗎？」\n彬彬就說：對",
    "為什麼史丹利實況都沒看到他在喝水，笑死，機器人哪有在喝水的",
    "Toyz為什麼不開台 因為他關台中",
    "史丹利吃黃連\n苦啊",
    "史丹利最討厭的星座是水瓶座\n這到底甚麼水平",
    "John Wick是甚麼樣的殺手\n銀翼殺手，一個酷酷的諧音梗😎😎",
    "誰敢亂約泡\n力宏，因為力宏敢喇"
]

jayo_contents = [
    "對面男刀不自覺已經落入我的斬殺線，雲中探花手拉住，開始請他吃刀削，邊走邊削，成功借到300塊。",
    "雲中探花手拉住，刀削來回藤轉，接萬毒歸宗，再QA，拿下拿下",
    "奶奶總說，就是現在，艾歐尼亞，決不撤退！",
    "Q上去不動冥王擋住，AQ，好，請借我三百塊",
    "噢！老天，閃線遷了個墳",
    "白癡打成這樣又要輸ㄛ",
    "欸欸欸暈住暈住，對面好運解被我暈到",
    "都我在打欸"
]

brad_contents = [
    "งี่เง่า",
    "ฮ่า ๆ ๆ ๆ",
    "เอาไปแปลได้จริงๆ",
    "ฉันห่วย"
]

tft_chess_limit = "https://truth.bahamut.com.tw/s01/201907/1ae1435ac4660199c0e42c7f8c8ef7b9.JPG?w=1000"

class banRecord:
    def __init__(self, banDate, banContent) -> None:
        self.banDate = banDate
        self.banContent = banContent